garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1829LIN.PIC
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x1D"/>
        <edc:SFRDef edc:access="nn--nnrn" edc:cname="CPSCON0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---0000" edc:name="CPSCON0" edc:nzwidth="8" edc:por="0---0000" edc:_addr="0x1E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T0XCS" edc:desc="" edc:mask="0x1" edc:name="T0XCS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSOUT" edc:desc="" edc:mask="0x1" edc:name="CPSOUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSRNG0" edc:desc="" edc:mask="0x1" edc:name="CPSRNG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSRNG1" edc:desc="" edc:mask="0x1" edc:name="CPSRNG1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CPSRM" edc:desc="" edc:mask="0x1" edc:name="CPSRM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSON" edc:desc="" edc:mask="0x1" edc:name="CPSON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CPSRNG" edc:desc="" edc:mask="0x3" edc:name="CPSRNG" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CPSCON1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CPSCON1" edc:nzwidth="8" edc:por="----0000" edc:_addr="0x1F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CPSCH0" edc:desc="" edc:mask="0x1" edc:name="CPSCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSCH1" edc:desc="" edc:mask="0x1" edc:name="CPSCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSCH2" edc:desc="" edc:mask="0x1" edc:name="CPSCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSCH3" edc:desc="" edc:mask="0x1" edc:name="CPSCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CPSCH" edc:desc="" edc:mask="0x7" edc:name="CPSCH" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="1" edc:beginaddr="0x80" edc:endaddr="0xA0" edc:regionid="sfr1">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x80"/>
        <edc:SFRDef edc:access="--nnrnnn" edc:cname="TRISA" edc:desc="PORTA Data Direction Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="TRISA" edc:nzwidth="0x8" edc:por="--111111" edc:_addr="0x8C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="TRISB" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111----" edc:name="TRISB" edc:nzwidth="8" edc:por="1111----" edc:_addr="0x8D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISC" edc:desc="PORTB Data Direction Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISC" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0x8E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISC0" edc:desc="" edc:mask="0x1" edc:name="TRISC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC2" edc:desc="" edc:mask="0x1" edc:name="TRISC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC3" edc:desc="" edc:mask="0x1" edc:name="TRISC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC4" edc:desc="" edc:mask="0x1" edc:name="TRISC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC5" edc:desc="" edc:mask="0x1" edc:name="TRISC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC6" edc:desc="" edc:mask="0x1" edc:name="TRISC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISC7" edc:desc="" edc:mask="0x1" edc:name="TRISC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x8F"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE1" edc:desc="Peripheral Interrupt Enable Register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE1" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:desc="TMR1 Overflow Interrupt Enable bit" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IE" edc:desc="TMR2 to PR2 Match Interrupt Enable bit" edc:mask="0x1" edc:name="TMR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:desc="CCP1 Interrupt Enable bit" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1IE" edc:desc="Master Synchronous Serial Port (MSSP) Interrupt Enable bit" edc:mask="0x1" edc:name="SSP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXIE" edc:desc="EUSART Transmit Interrupt Enable bit" edc:mask="0x1" edc:name="TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIE" edc:desc="EUSART Receive Interrupt Enable bit" edc:mask="0x1" edc:name="RCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:desc="A/D Converter Interrupt Enable bit" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIE" edc:desc="Timer1 Gate Interrupt Enable bit" edc:mask="0x1" edc:name="TMR1GIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn--n" edc:cname="PIE2" edc:desc="Peripheral Interrupt Enable Register 2" edc:impl="0xf5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000--0" edc:name="PIE2" edc:nzwidth="0x8" edc:por="00000--0" edc:_addr="0x92">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2IE" edc:desc="" edc:mask="0x1" edc:name="CCP2IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BCL1IE" edc:desc="MSSP Bus Collision Interrupt Interrupt Enable bit" edc:mask="0x1" edc:name="BCL1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EEIE" edc:desc="EEPROM Write Completion Interrupt Enable bit" edc:mask="0x1" edc:name="EEIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1IE" edc:desc="Comparator C1 Interrupt Enable bit" edc:mask="0x1" edc:name="C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2IE" edc:desc="Comparator C2 Interrupt Enable bit" edc:mask="0x1" edc:name="C2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIE" edc:desc="CCP2 Interrupt Enable bit" edc:mask="0x1" edc:name="OSFIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnn-n-" edc:cname="PIE3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000-0-" edc:name="PIE3" edc:nzwidth="8" edc:por="--000-0-" edc:_addr="0x93">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR4IE" edc:desc="" edc:mask="0x1" edc:name="TMR4IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR6IE" edc:desc="" edc:mask="0x1" edc:name="TMR6IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3IE" edc:desc="" edc:mask="0x1" edc:name="CCP3IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4IE" edc:desc="" edc:mask="0x1" edc:name="CCP4IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PIE4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PIE4" edc:nzwidth="8" edc:por="------00" edc:_addr="0x94">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSP2IE" edc:desc="" edc:mask="0x1" edc:name="SSP2IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCL2IE" edc:desc="" edc:mask="0x1" edc:name="BCL2IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPTION_REG" edc:desc="Option Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="OPTION_REG" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0x95">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="Prescaler Rate Select bits" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="Prescaler Rate Select bits" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="Prescaler Rate Select bits" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSA" edc:desc="Prescaler Active bit" edc:mask="0x1" edc:name="PSA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0SE" edc:desc="TMR0 Source Edge Select bit" edc:mask="0x1" edc:name="TMR0SE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0CS" edc:desc="TMR0 Clock Source Select bit" edc:mask="0x1" edc:name="TMR0CS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTEDG" edc:desc="Interrupt Edge Select bit" edc:mask="0x1" edc:name="INTEDG" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nWPUEN" edc:desc="Weak Pull-up Enable bit" edc:mask="0x1" edc:name="nWPUEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PS" edc:desc="Prescaler Rate Select bits" edc:mask="0x7" edc:name="PS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T0SE" edc:desc="" edc:mask="0x1" edc:name="T0SE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CS" edc:desc="" edc:mask="0x1" edc:name="T0CS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="PCON" edc:desc="Power Control Register" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qq--qquu" edc:name="PCON" edc:nzwidth="0x8" edc:por="00--11qq" edc:_addr="0x96">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="nBOR" edc:desc="Brown-out Reset Status bit" edc:mask="0x1" edc:name="nBOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPOR" edc:desc="Power-on Reset Status bit" edc:mask="0x1" edc:name="nPOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nRI" edc:desc="RESET Instruction Flag bit" edc:mask="0x1" edc:name="nRI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nRMCLR" edc:desc="MCLR Reset Flag bit" edc:mask="0x1" edc:name="nRMCLR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="STKUNF" edc:desc="Stack Underflow Flag bit" edc:mask="0x1" edc:name="STKUNF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STKOVF" edc:desc="Stack Overflow Flag bit" edc:mask="0x1" edc:name="STKOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="WDTCON" edc:desc="Watchdog Timer Control Register" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--010110" edc:name="WDTCON" edc:nzwidth="0x8" edc:por="--010110" edc:_addr="0x97">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="Software Enable/Disable for Watch Dog Timer bit" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTPS0" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1" edc:name="WDTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS1" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1" edc:name="WDTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS2" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1" edc:name="WDTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS3" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1" edc:name="WDTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS4" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1" edc:name="WDTPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="OSCTUNE" edc:desc="Oscillator Tuning Register" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="OSCTUNE" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x98">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:desc="Frequency Tuning bits" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:desc="Frequency Tuning bits" edc:mask="0x1" edc:name="TUN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:desc="Frequency Tuning bits" edc:mask="0x1" edc:name="TUN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:desc="Frequency Tuning bits" edc:mask="0x1" edc:name="TUN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN4" edc:desc="Frequency Tuning bits" edc:mask="0x1" edc:name="TUN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN5" edc:desc="Frequency Tuning bits" edc:mask="0x1" edc:name="TUN5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:desc="Frequency Tuning bits" edc:mask="0x3f" edc:name="TUN" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="OSCCON" edc:desc="Oscillator Control Register" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00111-00" edc:name="OSCCON" edc:nzwidth="0x8" edc:por="00111-00" edc:_addr="0x99">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCS0" edc:desc="System clock select bit" edc:mask="0x1" edc:name="SCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCS1" edc:desc="System clock select bit" edc:mask="0x1" edc:name="SCS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IRCF0" edc:desc="Internal Oscillator Frequency Select bits" edc:mask="0x1" edc:name="IRCF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRCF1" edc:desc="Internal Oscillator Frequency Select bits" edc:mask="0x1" edc:name="IRCF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRCF2" edc:desc="Internal Oscillator Frequency Select bits" edc:mask="0x1" edc:name="IRCF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRCF3" edc:desc="Internal Oscillator Frequency Select bits" edc:mask="0x1" edc:name="IRCF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPLLEN" edc:desc="Software PLL Enable bit" edc:mask="0x1" edc:name="SPLLEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SCS" edc:desc="System clock select bit" edc:mask="0x3" edc:name="SCS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IRCF" edc:desc="Internal Oscillator Frequency Select bits" edc:mask="0xf" edc:name="IRCF" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="OSCSTAT" edc:desc="Oscillator Status Register" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqq0q" edc:name="OSCSTAT" edc:nzwidth="0x8" edc:por="00q00q00" edc:_addr="0x9A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HFIOFS" edc:desc="Low Freqency Internal Oscillator Ready bit" edc:mask="0x1" edc:name="HFIOFS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LFIOFR" edc:desc="Low Freqency Internal Oscillator Ready bit" edc:mask="0x1" edc:name="LFIOFR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MFIOFR" edc:desc="Medium Freqency Internal Oscillator Ready bit" edc:mask="0x1" edc:name="MFIOFR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HFIOFL" edc:desc="High Freqency Internal Oscillator Status Locked bit" edc:mask="0x1" edc:name="HFIOFL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HFIOFR" edc:desc="High Freqency Internal Oscillator Ready bit" edc:mask="0x1" edc:name="HFIOFR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OSTS" edc:desc="Oscillator Start-up Time-out Status bit" edc:mask="0x1" edc:name="OSTS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLR" edc:desc="4x PLL Ready bit" edc:mask="0x1" edc:name="PLLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1OSCR" edc:desc="Timer1 Oscillator Ready bit" edc:mask="0x1" edc:name="T1OSCR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="ADRES" edc:desc="" edc:name="ADRES" edc:nzwidth="0x10" edc:_addr="0x9B">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRESL" edc:desc="A/D Result Register LSB" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="ADRESL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x9B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESL" edc:desc="" edc:mask="0xff" edc:name="ADRESL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRESH" edc:desc="A/D Result Register MSB" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="ADRESH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x9C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESH" edc:desc="" edc:mask="0xff" edc:name="ADRESH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
