garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1829LIN.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="ADCON0" edc:desc="Analog-to-Digital Control Register 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="ADCON0" edc:nzwidth="0x8" edc:por="-0000000" edc:_addr="0x9D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="A/D Module Enable bit" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:desc="A/D Conversion Status bit" edc:mask="0x1" edc:name="GO/nDONE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS0" edc:desc="Analog Channel Select bits" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:desc="Analog Channel Select bits" edc:mask="0x1" edc:name="CHS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS2" edc:desc="Analog Channel Select bits" edc:mask="0x1" edc:name="CHS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS3" edc:desc="Analog Channel Select bits" edc:mask="0x1" edc:name="CHS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS4" edc:desc="Analog Channel Select bits" edc:mask="0x1" edc:name="CHS4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADGO" edc:desc="A/D Conversion Status bit" edc:mask="0x1" edc:name="ADGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="Analog Channel Select bits" edc:mask="0x1f" edc:name="CHS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:desc="A/D Conversion Status bit" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="ADCON1" edc:desc="Analog-to-Digital Control Register 1" edc:impl="0x70" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="ADCON1" edc:nzwidth="0x8" edc:por="0000-000" edc:_addr="0x9E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPREF0" edc:desc="A/D Positive Voltage Reference Configuration" edc:mask="0x1" edc:name="ADPREF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPREF1" edc:desc="A/D Positive Voltage Reference Configuration" edc:mask="0x1" edc:name="ADPREF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADNREF" edc:desc="A/D Negative Voltage Reference Configuration" edc:mask="0x1" edc:name="ADNREF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCS0" edc:desc="A/D Conversion Clock Select bits" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:desc="A/D Conversion Clock Select bits" edc:mask="0x1" edc:name="ADCS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:desc="A/D Conversion Clock Select bits" edc:mask="0x1" edc:name="ADCS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:desc="A/D Result Format Select bit" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPREF" edc:desc="A/D Positive Voltage Reference Configuration" edc:mask="0x3" edc:name="ADPREF" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ADCS" edc:desc="A/D Conversion Clock Select bits" edc:mask="0x7" edc:name="ADCS" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="2" edc:beginaddr="0x100" edc:endaddr="0x120" edc:regionid="sfr2">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x100"/>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="LATA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uu-uuu" edc:name="LATA" edc:nzwidth="0x8" edc:por="--xx-xxx" edc:_addr="0x10C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="LATB" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu----" edc:name="LATB" edc:nzwidth="8" edc:por="xxxx----" edc:_addr="0x10D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATC" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x10E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC4" edc:desc="" edc:mask="0x1" edc:name="LATC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC5" edc:desc="" edc:mask="0x1" edc:name="LATC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATC7" edc:desc="" edc:mask="0x1" edc:name="LATC7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="PWRGD" edc:desc="" edc:mask="0x1" edc:name="PWRGD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x10F"/>
        <edc:SFRDef edc:access="nrnn-nnn" edc:cname="CM1CON0" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-100" edc:name="CM1CON0" edc:nzwidth="0x8" edc:por="0000-100" edc:_addr="0x111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="C1SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C1HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1SP" edc:desc="Comparator Speed/Power Select bit" edc:mask="0x1" edc:name="C1SP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C1POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="C1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1OE" edc:desc="Comparator Output Enable bit" edc:mask="0x1" edc:name="C1OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1ON" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="C1ON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="CM1CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="CM1CON1" edc:nzwidth="0x8" edc:por="0000--00" edc:_addr="0x112">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1NCH0" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1NCH1" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C1PCH0" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH1" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="C1INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="C1INTP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1NCH" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x3" edc:name="C1NCH" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C1PCH" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x3" edc:name="C1PCH" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnn-nnn" edc:cname="CM2CON0" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-100" edc:name="CM2CON0" edc:nzwidth="0x8" edc:por="0000-100" edc:_addr="0x113">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C2SYNC" edc:desc="" edc:mask="0x1" edc:name="C2SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS" edc:desc="" edc:mask="0x1" edc:name="C2HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2SP" edc:desc="" edc:mask="0x1" edc:name="C2SP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2POL" edc:desc="" edc:mask="0x1" edc:name="C2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OE" edc:desc="" edc:mask="0x1" edc:name="C2OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2ON" edc:desc="" edc:mask="0x1" edc:name="C2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="CM2CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="CM2CON1" edc:nzwidth="0x8" edc:por="0000--00" edc:_addr="0x114">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C2NCH0" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x1" edc:name="C2NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH1" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x1" edc:name="C2NCH1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C2PCH0" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x1" edc:name="C2PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH1" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x1" edc:name="C2PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="C2INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="C2INTP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2NCH" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x3" edc:name="C2NCH" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C2PCH" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x3" edc:name="C2PCH" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rr" edc:cname="CMOUT" edc:desc="Comparator Output Register" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CMOUT" edc:nzwidth="8" edc:por="------00" edc:_addr="0x115">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MC1OUT" edc:desc="" edc:mask="0x1" edc:name="MC1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MC2OUT" edc:desc="" edc:mask="0x1" edc:name="MC2OUT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n------r" edc:cname="BORCON" edc:desc="Brown-out Reset Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u------u" edc:name="BORCON" edc:nzwidth="8" edc:por="1------q" edc:_addr="0x116">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BORRDY" edc:desc="Brown-out Reset Circuit Ready Status bit" edc:mask="0x1" edc:name="BORRDY" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="SBOREN" edc:desc="Software Brown Out Reset Enable bit" edc:mask="0x1" edc:name="SBOREN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnnnnnn" edc:cname="FVRCON" edc:desc="Fixed Voltage Reference Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0q000000" edc:name="FVRCON" edc:nzwidth="8" edc:por="0q000000" edc:_addr="0x117">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADFVR0" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="ADFVR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADFVR1" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="ADFVR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR0" edc:desc="Comparator and D/A Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="CDAFVR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR1" edc:desc="Comparator and D/A Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="CDAFVR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSRNG" edc:desc="Temperature Indicator Range Selection" edc:mask="0x1" edc:name="TSRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Temperature Indicator Enable" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:desc="Fixed Voltage Reference Ready Flag" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:desc="Fixed Voltage Reference Enable" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADFVR" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x3" edc:name="ADFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CDAFVR" edc:desc="Comparator and D/A Converter Fixed Voltage Reference Selection" edc:mask="0x3" edc:name="CDAFVR" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nn-n" edc:cname="DACCON0" edc:desc="Voltage Reference Control Register 0" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-00-0" edc:name="DACCON0" edc:nzwidth="8" edc:por="000-00-0" edc:_addr="0x118">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="DAC1 Negative Source Select bits" edc:mask="0x1" edc:name="DACNSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="DAC1 Voltage Output Enable bit" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACLPS" edc:desc="DAC 1 Low Power Voltage State Select bit" edc:mask="0x1" edc:name="DACLPS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="DAC 1 Enable bit" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
