garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1829LIN.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DACCON1" edc:desc="Voltage Reference Control Register 1" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DACCON1" edc:nzwidth="8" edc:por="---00000" edc:_addr="0x119">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SRCON0" edc:desc="SR Latch Control Register 0" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SRCON0" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x11A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRPR" edc:desc="Pulse Reset Input of the SR Latch" edc:mask="0x1" edc:name="SRPR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRPS" edc:desc="Pulse Set Input of the SR Latch" edc:mask="0x1" edc:name="SRPS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRNQEN" edc:desc="SR Latch Q Output Enable bit" edc:mask="0x1" edc:name="SRNQEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRQEN" edc:desc="SR Latch Q Output Enable bit" edc:mask="0x1" edc:name="SRQEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK0" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK1" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK2" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRLEN" edc:desc="SR Latch Enable bit" edc:mask="0x1" edc:name="SRLEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SRCLK" edc:desc="SR Latch Clock divider bits" edc:mask="0x7" edc:name="SRCLK" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SRCON1" edc:desc="SR Latch Control Register 1" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SRCON1" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x11B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRRC1E" edc:desc="SR Latch C1 Reset Enable bit" edc:mask="0x1" edc:name="SRRC1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRC2E" edc:desc="SR Latch C2 Reset Enable bit" edc:mask="0x1" edc:name="SRRC2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRCKE" edc:desc="SR Latch Reset Clock Enable bit" edc:mask="0x1" edc:name="SRRCKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRPE" edc:desc="SR Latch Peripheral Reset Enable bit" edc:mask="0x1" edc:name="SRRPE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSC1E" edc:desc="SR Latch C1 Set Enable bit" edc:mask="0x1" edc:name="SRSC1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSC2E" edc:desc="SR Latch C2 Set Enable bit" edc:mask="0x1" edc:name="SRSC2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSCKE" edc:desc="SR Latch Set Clock Enable bit" edc:mask="0x1" edc:name="SRSCKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSPE" edc:desc="SR Latch Peripheral Set Enable bit" edc:mask="0x1" edc:name="SRSPE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x11C"/>
        <edc:SFRDef edc:access="n---nn--" edc:cname="APFCON0" edc:desc="Alternate Pin Function Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---00--" edc:name="APFCON0" edc:nzwidth="8" edc:por="0---00--" edc:_addr="0x11D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXCKSEL" edc:desc="" edc:mask="0x1" edc:name="TXCKSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GSEL" edc:desc="" edc:mask="0x1" edc:name="T1GSEL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXDTSEL" edc:desc="" edc:mask="0x1" edc:name="RXDTSEL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="APFCON1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="APFCON1" edc:nzwidth="8" edc:por="----0000" edc:_addr="0x11E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2SEL" edc:mask="0x1" edc:name="CCP2SEL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2BSEL" edc:mask="0x1" edc:name="P2BSEL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1CSEL" edc:mask="0x1" edc:name="P1CSEL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1DSEL" edc:mask="0x1" edc:name="P1DSEL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1A0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x180"/>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="ANSELA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---1-111" edc:name="ANSELA" edc:nzwidth="0x8" edc:por="---1-111" edc:_addr="0x18C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELA" edc:desc="" edc:mask="0x1f" edc:name="ANSELA" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="ANSELB" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111----" edc:name="ANSELB" edc:nzwidth="8" edc:por="1111----" edc:_addr="0x18D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ANSB4" edc:desc="" edc:mask="0x1" edc:name="ANSB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB5" edc:desc="" edc:mask="0x1" edc:name="ANSB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB6" edc:desc="" edc:mask="0x1" edc:name="ANSB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB7" edc:desc="" edc:mask="0x1" edc:name="ANSB7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ANSELB" edc:desc="" edc:mask="0xf" edc:name="ANSELB" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="ANSELC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11--1111" edc:name="ANSELC" edc:nzwidth="0x8" edc:por="11--1111" edc:_addr="0x18E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSC0" edc:desc="" edc:mask="0x1" edc:name="ANSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC1" edc:desc="" edc:mask="0x1" edc:name="ANSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC2" edc:desc="" edc:mask="0x1" edc:name="ANSC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC3" edc:desc="" edc:mask="0x1" edc:name="ANSC3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSC6" edc:desc="" edc:mask="0x1" edc:name="ANSC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC7" edc:desc="" edc:mask="0x1" edc:name="ANSC7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELC" edc:desc="" edc:mask="0xff" edc:name="ANSELC" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x18F"/>
        <edc:JoinedSFRDef edc:cname="EEADR" edc:desc="" edc:name="EEADR" edc:nzwidth="0x10" edc:_addr="0x191">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EEADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="EEADRL" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x191">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="EEADRL" edc:desc="" edc:mask="0xff" edc:name="EEADRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
