garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1829LIN.PIC
        <edc:SFRDef edc:access="nnnn----" edc:cname="WPUB" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111----" edc:name="WPUB" edc:nzwidth="8" edc:por="1111----" edc:_addr="0x20D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="WPUB4" edc:desc="" edc:mask="0x1" edc:name="WPUB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB5" edc:desc="" edc:mask="0x1" edc:name="WPUB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB6" edc:desc="" edc:mask="0x1" edc:name="WPUB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB7" edc:desc="" edc:mask="0x1" edc:name="WPUB7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="WPUB" edc:desc="" edc:mask="0xf" edc:name="WPUB" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUC" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="WPUC" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x20E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUC0" edc:desc="" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUC1" edc:desc="" edc:mask="0x1" edc:name="WPUC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUC2" edc:desc="" edc:mask="0x1" edc:name="WPUC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUC3" edc:desc="" edc:mask="0x1" edc:name="WPUC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUC4" edc:desc="" edc:mask="0x1" edc:name="WPUC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUC5" edc:desc="" edc:mask="0x1" edc:name="WPUC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUC6" edc:desc="" edc:mask="0x1" edc:name="WPUC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUC7" edc:desc="" edc:mask="0x1" edc:name="WPUC7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WPUC" edc:desc="" edc:mask="0xff" edc:name="WPUC" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x20F"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1BUF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SSP1BUF" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x211">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="SSPBUF"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPBUF" edc:desc="" edc:mask="0xff" edc:name="SSPBUF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1ADD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1ADD" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x212">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="SSPADD"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPADD" edc:desc="" edc:mask="0xff" edc:name="SSPADD" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1MSK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SSP1MSK" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0x213">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="SSPMSK"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPMSK" edc:desc="" edc:mask="0xff" edc:name="SSPMSK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrrrrr" edc:cname="SSP1STAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1STAT" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x214">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="SSPSTAT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BF" edc:desc="" edc:mask="0x1" edc:name="BF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UA" edc:desc="" edc:mask="0x1" edc:name="UA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="R_nW" edc:desc="" edc:mask="0x1" edc:name="R/nW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D_nA" edc:desc="" edc:mask="0x1" edc:name="D/nA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
