garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1829LIN.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP1CON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP1CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x293">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1M0" edc:desc="" edc:mask="0x1" edc:name="CCP1M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M1" edc:desc="" edc:mask="0x1" edc:name="CCP1M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M2" edc:desc="" edc:mask="0x1" edc:name="CCP1M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M3" edc:desc="" edc:mask="0x1" edc:name="CCP1M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC1B0" edc:desc="" edc:mask="0x1" edc:name="DC1B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC1B1" edc:desc="" edc:mask="0x1" edc:name="DC1B1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1M0" edc:desc="" edc:mask="0x1" edc:name="P1M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1M1" edc:desc="" edc:mask="0x1" edc:name="P1M1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1M" edc:desc="" edc:mask="0xf" edc:name="CCP1M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC1B" edc:desc="" edc:mask="0x3" edc:name="DC1B" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P1M" edc:desc="" edc:mask="0x3" edc:name="P1M" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM1CON" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x294">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P1DC0" edc:desc="" edc:mask="0x1" edc:name="P1DC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC1" edc:desc="" edc:mask="0x1" edc:name="P1DC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC2" edc:desc="" edc:mask="0x1" edc:name="P1DC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC3" edc:desc="" edc:mask="0x1" edc:name="P1DC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC4" edc:desc="" edc:mask="0x1" edc:name="P1DC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC5" edc:desc="" edc:mask="0x1" edc:name="P1DC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC6" edc:desc="" edc:mask="0x1" edc:name="P1DC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1RSEN" edc:desc="" edc:mask="0x1" edc:name="P1RSEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P1DC" edc:desc="" edc:mask="0x7f" edc:name="P1DC" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP1AS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP1AS" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x295">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="ECCP1AS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSS1BD0" edc:desc="" edc:mask="0x1" edc:name="PSS1BD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1BD1" edc:desc="" edc:mask="0x1" edc:name="PSS1BD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1AC0" edc:desc="" edc:mask="0x1" edc:name="PSS1AC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1AC1" edc:desc="" edc:mask="0x1" edc:name="PSS1AC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1AS0" edc:desc="" edc:mask="0x1" edc:name="CCP1AS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1AS1" edc:desc="" edc:mask="0x1" edc:name="CCP1AS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1AS2" edc:desc="" edc:mask="0x1" edc:name="CCP1AS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1ASE" edc:desc="" edc:mask="0x1" edc:name="CCP1ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSS1BD" edc:desc="" edc:mask="0x3" edc:name="PSS1BD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS1AC" edc:desc="" edc:mask="0x3" edc:name="PSS1AC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CCP1AS" edc:desc="" edc:mask="0x7" edc:name="CCP1AS" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PSTR1CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00001" edc:name="PSTR1CON" edc:nzwidth="8" edc:por="---00001" edc:_addr="0x296">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STR1A" edc:desc="" edc:mask="0x1" edc:name="STR1A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR1B" edc:desc="" edc:mask="0x1" edc:name="STR1B" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR1C" edc:desc="" edc:mask="0x1" edc:name="STR1C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR1D" edc:desc="" edc:mask="0x1" edc:name="STR1D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR1SYNC" edc:desc="" edc:mask="0x1" edc:name="STR1SYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x297"/>
        <edc:JoinedSFRDef edc:cname="CCPR2" edc:desc="" edc:name="CCPR2" edc:nzwidth="0x10" edc:_addr="0x298">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x298">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR2L" edc:desc="" edc:mask="0xff" edc:name="CCPR2L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x299">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR2H" edc:desc="" edc:mask="0xff" edc:name="CCPR2H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
