garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1829LIN.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP2CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP2CON" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x29A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2M0" edc:desc="" edc:mask="0x1" edc:name="CCP2M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M1" edc:desc="" edc:mask="0x1" edc:name="CCP2M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M2" edc:desc="" edc:mask="0x1" edc:name="CCP2M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M3" edc:desc="" edc:mask="0x1" edc:name="CCP2M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC2B0" edc:desc="" edc:mask="0x1" edc:name="DC2B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC2B1" edc:desc="" edc:mask="0x1" edc:name="DC2B1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2M0" edc:desc="" edc:mask="0x1" edc:name="P2M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2M1" edc:desc="" edc:mask="0x1" edc:name="P2M1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2M" edc:desc="" edc:mask="0xf" edc:name="CCP2M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC2B" edc:desc="" edc:mask="0x3" edc:name="DC2B" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P2M" edc:desc="" edc:mask="0x3" edc:name="P2M" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM2CON" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x29B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P2DC0" edc:desc="" edc:mask="0x1" edc:name="P2DC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC1" edc:desc="" edc:mask="0x1" edc:name="P2DC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC2" edc:desc="" edc:mask="0x1" edc:name="P2DC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC3" edc:desc="" edc:mask="0x1" edc:name="P2DC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC4" edc:desc="" edc:mask="0x1" edc:name="P2DC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC5" edc:desc="" edc:mask="0x1" edc:name="P2DC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC6" edc:desc="" edc:mask="0x1" edc:name="P2DC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2RSEN" edc:desc="" edc:mask="0x1" edc:name="P2RSEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P2DC" edc:desc="" edc:mask="0x7f" edc:name="P2DC" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP2AS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP2AS" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x29C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSS2BD0" edc:desc="" edc:mask="0x1" edc:name="PSS2BD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS2BD1" edc:desc="" edc:mask="0x1" edc:name="PSS2BD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS2AC0" edc:desc="" edc:mask="0x1" edc:name="PSS2AC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS2AC1" edc:desc="" edc:mask="0x1" edc:name="PSS2AC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2AS0" edc:desc="" edc:mask="0x1" edc:name="CCP2AS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2AS1" edc:desc="" edc:mask="0x1" edc:name="CCP2AS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2AS2" edc:desc="" edc:mask="0x1" edc:name="CCP2AS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2ASE" edc:desc="" edc:mask="0x1" edc:name="CCP2ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSS2BD" edc:desc="" edc:mask="0x3" edc:name="PSS2BD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS2AC" edc:desc="" edc:mask="0x3" edc:name="PSS2AC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CCP2AS" edc:desc="" edc:mask="0x7" edc:name="CCP2AS" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PSTR2CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00001" edc:name="PSTR2CON" edc:nzwidth="8" edc:por="---00001" edc:_addr="0x29D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STR2A" edc:desc="" edc:mask="0x1" edc:name="STR2A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR2B" edc:desc="" edc:mask="0x1" edc:name="STR2B" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR2C" edc:desc="" edc:mask="0x1" edc:name="STR2C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR2D" edc:desc="" edc:mask="0x1" edc:name="STR2D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR2SYNC" edc:desc="" edc:mask="0x1" edc:name="STR2SYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPTMRS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCPTMRS" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x29E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CCPTMRS0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1TSEL0" edc:desc="" edc:mask="0x1" edc:name="C1TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1TSEL1" edc:desc="" edc:mask="0x1" edc:name="C1TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL0" edc:desc="" edc:mask="0x1" edc:name="C2TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL1" edc:desc="" edc:mask="0x1" edc:name="C2TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3TSEL0" edc:desc="" edc:mask="0x1" edc:name="C3TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3TSEL1" edc:desc="" edc:mask="0x1" edc:name="C3TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4TSEL0" edc:desc="" edc:mask="0x1" edc:name="C4TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4TSEL1" edc:desc="" edc:mask="0x1" edc:name="C4TSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1TSEL" edc:desc="" edc:mask="0x3" edc:name="C1TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C2TSEL" edc:desc="" edc:mask="0x3" edc:name="C2TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C3TSEL" edc:desc="" edc:mask="0x3" edc:name="C3TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C4TSEL" edc:desc="" edc:mask="0x3" edc:name="C4TSEL" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="6" edc:beginaddr="0x300" edc:endaddr="0x320" edc:regionid="sfr6">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x300"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x30C"/>
        <edc:JoinedSFRDef edc:cname="CCPR3" edc:desc="" edc:name="CCPR3" edc:nzwidth="0x10" edc:_addr="0x311">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR3L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR3L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x311">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR3L" edc:desc="" edc:mask="0xff" edc:name="CCPR3L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR3H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR3H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x312">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR3H" edc:desc="" edc:mask="0xff" edc:name="CCPR3H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
