garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1829LIN.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP3CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP3CON" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x313">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3M0" edc:desc="" edc:mask="0x1" edc:name="CCP3M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M1" edc:desc="" edc:mask="0x1" edc:name="CCP3M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M2" edc:desc="" edc:mask="0x1" edc:name="CCP3M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M3" edc:desc="" edc:mask="0x1" edc:name="CCP3M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC3B0" edc:desc="" edc:mask="0x1" edc:name="DC3B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC3B1" edc:desc="" edc:mask="0x1" edc:name="DC3B1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP3M" edc:desc="" edc:mask="0xf" edc:name="CCP3M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC3B" edc:desc="" edc:mask="0x3" edc:name="DC3B" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0x314"/>
        <edc:JoinedSFRDef edc:cname="CCPR4" edc:desc="" edc:name="CCPR4" edc:nzwidth="0x10" edc:_addr="0x318">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR4L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR4L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x318">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR4L" edc:desc="" edc:mask="0xff" edc:name="CCPR4L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR4H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR4H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x319">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR4H" edc:desc="" edc:mask="0xff" edc:name="CCPR4H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP4CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP4CON" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x31A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP4M0" edc:desc="" edc:mask="0x1" edc:name="CCP4M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4M1" edc:desc="" edc:mask="0x1" edc:name="CCP4M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4M2" edc:desc="" edc:mask="0x1" edc:name="CCP4M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4M3" edc:desc="" edc:mask="0x1" edc:name="CCP4M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC4B0" edc:desc="" edc:mask="0x1" edc:name="DC4B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC4B1" edc:desc="" edc:mask="0x1" edc:name="DC4B1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP4M" edc:desc="" edc:mask="0xf" edc:name="CCP4M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC4B" edc:desc="" edc:mask="0x3" edc:name="DC4B" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="7" edc:beginaddr="0x380" edc:endaddr="0x3A0" edc:regionid="sfr7">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x380"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INLVLA" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000100" edc:name="INLVLA" edc:nzwidth="8" edc:por="--000100" edc:_addr="0x38C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLA0" edc:desc="" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA1" edc:desc="" edc:mask="0x1" edc:name="INLVLA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA2" edc:desc="" edc:mask="0x1" edc:name="INLVLA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA3" edc:desc="" edc:mask="0x1" edc:name="INLVLA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA4" edc:desc="" edc:mask="0x1" edc:name="INLVLA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA5" edc:desc="" edc:mask="0x1" edc:name="INLVLA5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INLVLA" edc:desc="" edc:mask="0x3f" edc:name="INLVLA" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="INLVLB" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="INLVLB" edc:nzwidth="8" edc:por="0000----" edc:_addr="0x38D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="INLVLB4" edc:desc="" edc:mask="0x1" edc:name="INLVLB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB5" edc:desc="" edc:mask="0x1" edc:name="INLVLB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB6" edc:desc="" edc:mask="0x1" edc:name="INLVLB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB7" edc:desc="" edc:mask="0x1" edc:name="INLVLB7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="INLVLB" edc:desc="" edc:mask="0xf" edc:name="INLVLB" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLC" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLC" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x38E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLC0" edc:desc="" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC1" edc:desc="" edc:mask="0x1" edc:name="INLVLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC2" edc:desc="" edc:mask="0x1" edc:name="INLVLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC3" edc:desc="" edc:mask="0x1" edc:name="INLVLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC4" edc:desc="" edc:mask="0x1" edc:name="INLVLC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC5" edc:desc="" edc:mask="0x1" edc:name="INLVLC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC6" edc:desc="" edc:mask="0x1" edc:name="INLVLC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC7" edc:desc="" edc:mask="0x1" edc:name="INLVLC7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INLVLC" edc:desc="" edc:mask="0xff" edc:name="INLVLC" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x38F"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAP" edc:desc="Interrupt-On-Change Positive Edge Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAP" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x391">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAP0" edc:desc="" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP1" edc:desc="" edc:mask="0x1" edc:name="IOCAP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP2" edc:desc="" edc:mask="0x1" edc:name="IOCAP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP3" edc:desc="" edc:mask="0x1" edc:name="IOCAP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP4" edc:desc="" edc:mask="0x1" edc:name="IOCAP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP5" edc:desc="" edc:mask="0x1" edc:name="IOCAP5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCAP" edc:desc="" edc:mask="0x3f" edc:name="IOCAP" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAN" edc:desc="Interrupt-On-Change Negative Edge Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAN" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x392">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAN0" edc:desc="" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN1" edc:desc="" edc:mask="0x1" edc:name="IOCAN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN2" edc:desc="" edc:mask="0x1" edc:name="IOCAN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN3" edc:desc="" edc:mask="0x1" edc:name="IOCAN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN4" edc:desc="" edc:mask="0x1" edc:name="IOCAN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN5" edc:desc="" edc:mask="0x1" edc:name="IOCAN5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCAN" edc:desc="" edc:mask="0x3f" edc:name="IOCAN" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAF" edc:desc="Interrupt-On-Change Flag Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAF" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x393">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:desc="" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:desc="" edc:mask="0x1" edc:name="IOCAF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:desc="" edc:mask="0x1" edc:name="IOCAF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:desc="" edc:mask="0x1" edc:name="IOCAF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:desc="" edc:mask="0x1" edc:name="IOCAF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:desc="" edc:mask="0x1" edc:name="IOCAF5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCAF" edc:desc="" edc:mask="0x3f" edc:name="IOCAF" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBP" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBP" edc:nzwidth="8" edc:por="0000----" edc:_addr="0x394">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP4" edc:desc="" edc:mask="0x1" edc:name="IOCBP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP5" edc:desc="" edc:mask="0x1" edc:name="IOCBP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP6" edc:desc="" edc:mask="0x1" edc:name="IOCBP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP7" edc:desc="" edc:mask="0x1" edc:name="IOCBP7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBP" edc:desc="" edc:mask="0xf" edc:name="IOCBP" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBN" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBN" edc:nzwidth="8" edc:por="0000----" edc:_addr="0x395">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBN4" edc:desc="" edc:mask="0x1" edc:name="IOCBN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN5" edc:desc="" edc:mask="0x1" edc:name="IOCBN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN6" edc:desc="" edc:mask="0x1" edc:name="IOCBN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN7" edc:desc="" edc:mask="0x1" edc:name="IOCBN7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBN" edc:desc="" edc:mask="0xf" edc:name="IOCBN" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBF" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBF" edc:nzwidth="8" edc:por="0000----" edc:_addr="0x396">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBF4" edc:desc="" edc:mask="0x1" edc:name="IOCBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF5" edc:desc="" edc:mask="0x1" edc:name="IOCBF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF6" edc:desc="" edc:mask="0x1" edc:name="IOCBF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF7" edc:desc="" edc:mask="0x1" edc:name="IOCBF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBF" edc:desc="" edc:mask="0xf" edc:name="IOCBF" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
