garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1829LIN.PIC
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x397"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLKRCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00110000" edc:name="CLKRCON" edc:nzwidth="8" edc:por="00110000" edc:_addr="0x39A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV0" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV1" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV2" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC0" edc:desc="" edc:mask="0x1" edc:name="CLKRDC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC1" edc:desc="" edc:mask="0x1" edc:name="CLKRDC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRSLR" edc:desc="" edc:mask="0x1" edc:name="CLKRSLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKROE" edc:desc="" edc:mask="0x1" edc:name="CLKROE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKREN" edc:desc="" edc:mask="0x1" edc:name="CLKREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV" edc:desc="" edc:mask="0x7" edc:name="CLKRDIV" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CLKRDC" edc:desc="" edc:mask="0x3" edc:name="CLKRDC" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x39B"/>
        <edc:SFRDef edc:access="nnnnr--n" edc:cname="MDCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00100--0" edc:name="MDCON" edc:nzwidth="8" edc:por="00100--0" edc:_addr="0x39C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MDBIT" edc:desc="" edc:mask="0x1" edc:name="MDBIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MDOUT" edc:desc="" edc:mask="0x1" edc:name="MDOUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDOPOL" edc:desc="" edc:mask="0x1" edc:name="MDOPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDSLR" edc:desc="" edc:mask="0x1" edc:name="MDSLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDOE" edc:desc="" edc:mask="0x1" edc:name="MDOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDEN" edc:desc="" edc:mask="0x1" edc:name="MDEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="MDSRC" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u---uuuu" edc:name="MDSRC" edc:nzwidth="8" edc:por="x---xxxx" edc:_addr="0x39D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MDMS0" edc:desc="" edc:mask="0x1" edc:name="MDMS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDMS1" edc:desc="" edc:mask="0x1" edc:name="MDMS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDMS2" edc:desc="" edc:mask="0x1" edc:name="MDMS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDMS3" edc:desc="" edc:mask="0x1" edc:name="MDMS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="MDMSODIS" edc:desc="" edc:mask="0x1" edc:name="MDMSODIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDMS" edc:desc="" edc:mask="0xf" edc:name="MDMS" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="MDCARL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-uuuu" edc:name="MDCARL" edc:nzwidth="8" edc:por="xxx-xxxx" edc:_addr="0x39E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MDCL0" edc:desc="" edc:mask="0x1" edc:name="MDCL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCL1" edc:desc="" edc:mask="0x1" edc:name="MDCL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCL2" edc:desc="" edc:mask="0x1" edc:name="MDCL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCL3" edc:desc="" edc:mask="0x1" edc:name="MDCL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MDCLSYNC" edc:desc="" edc:mask="0x1" edc:name="MDCLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCLPOL" edc:desc="" edc:mask="0x1" edc:name="MDCLPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCLODIS" edc:desc="" edc:mask="0x1" edc:name="MDCLODIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCL" edc:desc="" edc:mask="0xf" edc:name="MDCL" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="MDCARH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-uuuu" edc:name="MDCARH" edc:nzwidth="8" edc:por="xxx-xxxx" edc:_addr="0x39F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MDCH0" edc:desc="" edc:mask="0x1" edc:name="MDCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCH1" edc:desc="" edc:mask="0x1" edc:name="MDCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCH2" edc:desc="" edc:mask="0x1" edc:name="MDCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCH3" edc:desc="" edc:mask="0x1" edc:name="MDCH3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MDCHSYNC" edc:desc="" edc:mask="0x1" edc:name="MDCHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCHPOL" edc:desc="" edc:mask="0x1" edc:name="MDCHPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCHODIS" edc:desc="" edc:mask="0x1" edc:name="MDCHODIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCH" edc:desc="" edc:mask="0xf" edc:name="MDCH" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x400"/>
        <edc:AdjustPoint edc:offset="9" edc:_addr="0x40C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR4" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x415">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4" edc:desc="" edc:mask="0xff" edc:name="TMR4" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR4" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x416">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR4" edc:desc="" edc:mask="0xff" edc:name="PR4" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T4CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T4CON" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x417">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T4CKPS0" edc:desc="" edc:mask="0x1" edc:name="T4CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS1" edc:desc="" edc:mask="0x1" edc:name="T4CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4ON" edc:desc="" edc:mask="0x1" edc:name="TMR4ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4CKPS" edc:desc="" edc:mask="0x3" edc:name="T4CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS" edc:desc="" edc:mask="0xf" edc:name="T4OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0x418"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR6" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR6" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x41C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR6" edc:desc="" edc:mask="0xff" edc:name="TMR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR6" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR6" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x41D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR6" edc:desc="" edc:mask="0xff" edc:name="PR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T6CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T6CON" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x41E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T6CKPS0" edc:desc="" edc:mask="0x1" edc:name="T6CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6CKPS1" edc:desc="" edc:mask="0x1" edc:name="T6CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6ON" edc:desc="" edc:mask="0x1" edc:name="TMR6ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6CKPS" edc:desc="" edc:mask="0x3" edc:name="T6CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS" edc:desc="" edc:mask="0xf" edc:name="T6OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="9" edc:beginaddr="0x480" edc:endaddr="0x4A0" edc:regionid="sfr9">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x480"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="10" edc:beginaddr="0x500" edc:endaddr="0x520" edc:regionid="sfr10">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x500"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="11" edc:beginaddr="0x580" edc:endaddr="0x5A0" edc:regionid="sfr11">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x580"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="12" edc:beginaddr="0x600" edc:endaddr="0x620" edc:regionid="sfr12">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x600"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6A0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x680"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="14" edc:beginaddr="0x700" edc:endaddr="0x720" edc:regionid="sfr14">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x700"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7A0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x780"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x800"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x880"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x900"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x980"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xda0" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="28" edc:beginaddr="0xe00" edc:endaddr="0xe20" edc:regionid="sfr28">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="29" edc:beginaddr="0xe80" edc:endaddr="0xea0" edc:regionid="sfr29">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="30" edc:beginaddr="0xf00" edc:endaddr="0xf20" edc:regionid="sfr30">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF80"/>
        <edc:AdjustPoint edc:offset="88" edc:_addr="0xF8C"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="STATUS_SHAD" edc:nzwidth="8" edc:por="-----xxx" edc:_addr="0xFE4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C_SHAD" edc:desc="" edc:mask="0x1" edc:name="C_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC_SHAD" edc:desc="" edc:mask="0x1" edc:name="DC_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Z_SHAD" edc:desc="" edc:mask="0x1" edc:name="Z_SHAD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="WREG_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFE5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG_SHAD" edc:desc="" edc:mask="0xff" edc:name="WREG_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
